<?php

use Illuminate\Http\Request;

/*
|--------------------------------------------------------------------------
| API Routes
|--------------------------------------------------------------------------
|
| Here is where you can register API routes for your application. These
| routes are loaded by the RouteServiceProvider within a group which
| is assigned the "api" middleware group. Enjoy building your API!
|
*/

Route::get('/user', function (Request $request) {
    return $request->user();
})->middleware('auth:api');

Route::any('/ar',function() {
    return "OFF";
});
//Route::any('/loader',function(){
//    $array=[
//        [
//            'title'=>'سشوار',
//            'image'=>'https://s0.divarcdn.com/static/wsthumbnails/1483965285/rLzupGFkk.webp',
//            'price'=>'79000 تومان',
//            'datatime'=>'نیم ساعت پیش',
//            'location'=>'ardabil',
//            'text'=>'برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود
//پرداخت وجه درب منزل شما
//برند: MOZER
//مدل: MZ-4920
//کیفیت عالی
//بهمراه دو سری مخصوص
//جنس بدنه: پلاستیک
//جنس المنت: سرامیکی
//دارای حلقه آویز و فیلتر پشتی
//گرم شدن بسیار سریع
//سرعت باد دو حالته
//تنظیم دما سه حالته
//دارای کلید سرد فوری
//قدرت: 2200w
//طول سیم: تقریبا2.20 متر
//بهمراه پکیجینگ
//برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود',
//            'user'=>'۰۹۳۰۴۳xxxx'
//        ],  [
//            'title'=>'سشوار',
//            'image'=>'https://s0.divarcdn.com/static/wsthumbnails/1483965259/38fQ1YwSx.webp',
//            'price'=>'79000 تومان',
//            'datatime'=>'نیم ساعت پیش',
//            'location'=>'ardabil',
//            'text'=>'برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود
//پرداخت وجه درب منزل شما
//برند: MOZER
//مدل: MZ-4920
//کیفیت عالی
//بهمراه دو سری مخصوص
//جنس بدنه: پلاستیک
//جنس المنت: سرامیکی
//دارای حلقه آویز و فیلتر پشتی
//گرم شدن بسیار سریع
//سرعت باد دو حالته
//تنظیم دما سه حالته
//دارای کلید سرد فوری
//قدرت: 2200w
//طول سیم: تقریبا2.20 متر
//بهمراه پکیجینگ
//برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود',
//            'user'=>'۰۹۳۰۴۳xxxx'
//        ],  [
//            'title'=>'سشوار',
//            'image'=>'https://s0.divarcdn.com/static/wsthumbnails/1483965231/zcwzkla_X.webp',
//            'price'=>'79000 تومان',
//            'datatime'=>'نیم ساعت پیش',
//            'location'=>'ardabil',
//            'text'=>'برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود
//پرداخت وجه درب منزل شما
//برند: MOZER
//مدل: MZ-4920
//کیفیت عالی
//بهمراه دو سری مخصوص
//جنس بدنه: پلاستیک
//جنس المنت: سرامیکی
//دارای حلقه آویز و فیلتر پشتی
//گرم شدن بسیار سریع
//سرعت باد دو حالته
//تنظیم دما سه حالته
//دارای کلید سرد فوری
//قدرت: 2200w
//طول سیم: تقریبا2.20 متر
//بهمراه پکیجینگ
//برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود',
//            'user'=>'۰۹۳۰۴۳xxxx'
//        ],  [
//            'title'=>'سشوار',
//            'image'=>'https://s0.divarcdn.com/static/wsthumbnails/1483964724/akZVVLZVB.webp',
//            'price'=>'79000 تومان',
//            'datatime'=>'نیم ساعت پیش',
//            'location'=>'ardabil',
//            'text'=>'برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود
//پرداخت وجه درب منزل شما
//برند: MOZER
//مدل: MZ-4920
//کیفیت عالی
//بهمراه دو سری مخصوص
//جنس بدنه: پلاستیک
//جنس المنت: سرامیکی
//دارای حلقه آویز و فیلتر پشتی
//گرم شدن بسیار سریع
//سرعت باد دو حالته
//تنظیم دما سه حالته
//دارای کلید سرد فوری
//قدرت: 2200w
//طول سیم: تقریبا2.20 متر
//بهمراه پکیجینگ
//برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود',
//            'user'=>'۰۹۳۰۴۳xxxx'
//        ],  [
//            'title'=>'سشوار',
//            'image'=>'https://s8.divarcdn.com/static/wsthumbnails/1482972490/RdWGrL5fV.webp',
//            'price'=>'79000 تومان',
//            'datatime'=>'نیم ساعت پیش',
//            'location'=>'ardabil',
//            'text'=>'برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود
//پرداخت وجه درب منزل شما
//برند: MOZER
//مدل: MZ-4920
//کیفیت عالی
//بهمراه دو سری مخصوص
//جنس بدنه: پلاستیک
//جنس المنت: سرامیکی
//دارای حلقه آویز و فیلتر پشتی
//گرم شدن بسیار سریع
//سرعت باد دو حالته
//تنظیم دما سه حالته
//دارای کلید سرد فوری
//قدرت: 2200w
//طول سیم: تقریبا2.20 متر
//بهمراه پکیجینگ
//برای سفارش و کسب اطلاعات بیشتر عدد 124 را پیامک کنید با شما تماس گرفته میشود',
//            'user'=>'۰۹۳۰۴۳xxxx'
//        ]
//
//    ];
//    return $array;
//});